Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/labour_relations_commission.html.txt.tmx
Source language: en
Languages: ga

source: The Workplace Relations Commission (WRC) was established on 1 October 2015 under the Workplace Relations Act 2015
ga: Bunaíodh An Coimisiún um Chaidreamh san Áit Oibre (WRC) an 1 Deireadh Fómhair 2015 de réir an tAcht um Chaidreamh san Áit Oibre 2015

source: It has taken over the functions of the National Employment Rights Authority, the Labour Relations Commission and the Director of the Equality Tribunal
ga: Ghabh sé chuige féin feidhmeanna an tÚdarás Náisiúnta Cearta Fostaíochta, an Coimisiún um Chaidreamh Oibreachais agus Stiúrthóir an Bhinse Comhionannais

source: It has also taken over some of the functions of the Employment Appeals Tribunal (EAT)
ga: Ghabh sé chuige féin freisin roinnt d’fheidhmeanna an Bhinse Achomhairc Fostaíochta (EAT)

source: However, the appeal functions of the EAT have been transferred to the Labour Court, which is now the single appeal body for all workplace relations appeals
ga: Is amhlaidh ámh a aistríodh feidhmeanna achomhairc an EAT chuig An Chúirt Oibreachais, arb í anois í an t-aon chomhlacht achomhairc i leith gach achomharc maidir le caidreamh sa láthair oibre

source: The main functions of the WRC are to:
ga: Is iad príomhfheidhmeanna an WRC:

source: • Promote the improvement of workplace relations, and maintenance of good workplace relations
ga: • Chun feabhsú an caidreamh sa láthair oibre a chothú, agus chun dea-chaidreamh sa láthair oibre a chothabháil

source: • Promote and encourage compliance with the relevant laws
ga: • Chun comhlíonadh leis na dlíthe ábhartha a chur chun cinn agus a spreagadh

source: • Provide guidance in relation to compliance with codes of practice
ga: • Chun treoir a sholáthar maidir leis an gcomhlíonadh leis na cóid chleachtais

source: • Conduct reviews of, and monitor developments as respects, workplace relations
ga: • Chun athbhreithnithe a stiúradh, agus chun forbairtí a mhonatóireacht maidir le caidreamh sa láthair oibre

source: • Conduct or commission relevant research and provide advice, information and the findings of research to Joint Labour Committees and Joint Industrial Councils
ga: • Chun taighde ábhartha a stiúradh nó a choimisiúnú agus chun comhairle, faisnéis agus torthaí an taighde a sholáthar do na Comhchoistí Oibre agus na Comhchomhairlí Tionsclaíocha

source: • Advise the Minister for Jobs, Enterprise and Innovation in relation to the application of, and compliance with, relevant laws
ga: • Chun comhairle a thabhairt don Aire Post, Fiontar agus Nuálaíochta i ndáil le cur chun feidhme, agus le comhlíonadh na ndlíthe ábhartha

source: • Provide information to the public in relation to employment laws other than the Employment Equality Act (information about this Act is provided by the Irish Human Rights and Equality Commission)
ga: • Chun eolas a sholáthar don phobal i ndáil le dlíthe fostaíochta seachas an tAcht um Chomhionannas Fostaíochta (tugtar faisnéis faoin Acht sin ó Choimisiún na hÉireann um Chearta an Duine agus Comhionannas)

source: The WRC may also provide advice on any matter relating to workplace relations to employers, their representative bodies and to employees, trade unions or other representative bodies of employees
ga: Féadann an WRC comhairle a thabhairt freisin i leith aon ábhair a bhaineann le caidreamh san áit oibre d’fhostóirí, dá gcomhlachtaí ionadaíocha agus d’fhostaithe, do cheardchumainn nó do chomhlachtaí ionadaíocha na bhfostaithe

source: It has specific functions in relation to the resolution of industrial disputes and the implementation of employment laws
ga: Bíonn feidhmeanna sonracha aige i ndáil le réiteach na ndíospóidí tionsclaíocha agus le forfheidhmiú na ndlíthe fostaíochta

source: It is the body to which all industrial relations disputes and all disputes and complaints about employment laws will be presented
ga: Is eisean an comhlacht a gcuirfear gach díospóid caidreamh tionsclaíoch agus gach díospóid agus gearán faoi na dlíthe fostaíochta faoina bhráid

source: More information is available in this guide to the Workplace Relations Commission (pdf)
ga: Tá a thuilleadh faisnéise ar fáil sa treoir seo don Choimisiún um Chaidreamh san Áit Oibre (pdf)

source: The WRC operates the following services:
ga: Oibríonn an WRC na seirbhísí seo a leanas:

source: The Advisory Service provides advice and assistance on industrial relations in the workplace to employers, employees and their representatives
ga: Is í an tSeirbhís Chomhairleach a sholáthraíonn comhairle agus cúnamh i leith caidreamh tionsclaíoch san áit oibre d’fhostóirí, fostaithe agus dá n-ionadaithe

source: It helps employers and employees to develop positive working relationships and mechanisms to solve problems. One of its services is preventative mediation, advising on grievance procedures and structural change
ga: Cuidíonn sí le fostóirí agus le fostaithe chun caidreamh oibre dearfacha a fhorbairt agus meicníochtaí chun fadhbanna a réiteach Is í an idirghabháil choisctheach ceann dá cuid seirbhísí, ag tabhairt comhairle i leith gnásanna casaoide agus athrú struchtúrach

source: The WRC has also published codes of practice including Grievance and Disciplinary Procedures and Procedures for addressing Bullying in the Workplace
ga: Is é an WRC freisin a d’fhoilsigh cóid chleachtais lenar áiríodh Nósanna Imeachta Casaoide agus Smachta agus Nósanna Imeachta chun aghaidh a thabhairt ar an Tromaíocht san Áit Oibre

source: You can read more in this list of frequently asked questions about the Advisory Service
ga: Is féidir leat a thuilleadh a léamh sa liosta ceisteanna coitianta faoin tSeirbhís Chomhairleach

source: The Conciliation Service helps employers and their employees to resolve disputes when they have failed to reach agreement during their own previous negotiations
ga: Cuidíonn an tSeirbhís Idir-Réitigh le fostóirí agus lena bhfostaithe chun díospóidí a réiteach nuair a theip orthu chun teacht ar chomhaontú i rith a gcaibidlíochtaí féin roimhe sin

source: An Industrial Relations Officer of the Commission acts as chairperson during meetings to negotiate an agreement
ga: Is é Oifigeach Caidreamh Tionsclaíoch de chuid an Choimisiúin a fheidhmíonn mar chathaoirleach le linn cruinnithe chun comhaontú a idirbheartú

source: The majority of the cases referred to conciliation are settled
ga: Tagtar ar shocraíocht i leith mhóramh na gcásanna a tharchuirtear chuig an idir-réiteach

source: If no agreement is reached then, if the parties wish, the dispute may be referred to the Labour Court
ga: Mura dtagtar ar aon chomhaontú is amhlaidh más mian leis na páirtithe ar féidir an díospóid a tharchur faoi bhráide na Cúirte Oibreachais

source: Mediation is a voluntary process which needs to have both sides agreeing to participate and to work towards resolving the problem
ga: Is próiseas saorálach í an idirghabháil óna dteastaíonn an dá pháirtí bheith ag comhaontú chun rannpháirt a ghlacadh inti agus chun saothrú i dtreo réiteach na faidhbe

source: It ensures that all the sides are heard and the participants are involved in finding an agreed solution
ga: Cinntíonn sí go n-éistear le gach taobh agus go mbíonn na rannpháirtithe bainteach ag teacht ar réiteach comhaontaithe

source: Employment rights issues: The WRC may offer a mediation service to facilitate the resolution of employment rights complaints or disputes without the use of adjudication
ga: Saincheisteanna maidir le cearta fostaíochta: Féadann an WRC seirbhís idirghabhála a thairiscint chun réiteach na ngearán nó na ndíospóidí i leith ceart fostaíochta a éascú, gan dul i muinín an bhreithniúcháin

source: They may only be referred for mediation with the agreement of both parties to the complaint or dispute
ga: Ní féidir iad a tharchur d’idirghabháil ach amháin le comhaontú an dá pháirtí leis an ngearán nó leis an díospóid

source: Where a complaint/dispute is not resolved, it will be referred for adjudication
ga: Tarchuirfear gearán/díospóid faoi bhreithniúchán sa chás nach réitítear iad

source: Find out more in our document about workplace mediation
ga: Faigh a thuilleadh eolais inár gcáipéis faoin idirghabháil sa láthair oibre

source: If you have made a complaint about your employment rights and you have agreed to participate in mediation you may be offered the Early Resolution Service (ERS) which is part of the Mediation Service
ga: Má rinne tú gearán faoi do chearta fostaíochta agus gur aontaigh tú chun rannpháirt a ghlacadh san idirghabháil is amhlaidh a fhéadfar Seirbhís Luath-Réitigh (ERS) a thairiscint duit, ar cuid den tSeirbhís Idirghabhála í

source: The ERS contacts the parties to the dispute by phone with the aim of mediating a resolution
ga: Is í an ERS a dhéanann teagmháil leis na páirtithe do dhíospóid thar an nguthán leis an aidhm chun réiteach a idirghabháil

source: If the dispute is not resolved by the service, your complaint will be sent without any delay to the adjudication service
ga: Mura réitíonn an tseirbhís an díospóid, is amhlaidh a sheolfar do ghearán gan mhoill chuig an tseirbhís breithniúcháin

source: Internal workplace issues: The Workplace Mediation Service aims to resolve workplace disputes and disagreements, particularly between individuals or small groups
ga: Saincheisteanna laistigh den ionad oibre: Is éard is aidhm leis an tSeirbhís Idirghabhála san Áit Oibre ná chun díospóidí agus easaontuithe sa láthair oibre a réiteach, go háirithe idir daoine aonair nó grúpaí beaga

source: This confidential service, which is provided by officers of the WRC Conciliation and Advisory Services, gives employees and employers who are in dispute with each other an opportunity to work with a mediator to find a mutually agreed solution to problems, such as breakdown in a working relationship or issues arising from a grievance and disciplinary procedure
ga: Is tríd an tseirbhís rúnda sin, arb iad oifigigh Sheirbhísí Idir-Réitigh agus Comhairleacha an WRC a sholáthraíonn í, a thugtar deis d’fhostaithe agus d’fhostóirí atá i mbun díospóide lena chéile chun saothrú leis an idirghabhálaí chun teacht ar réiteach comhaontaithe le chéile, cuir i gcás clis i gcaidreamh oibre nó saincheisteanna a bhaineann le gnás casaoide agus smachta

source: The Adjudication Service (formerly the Rights Commissioner Service) investigates disputes, grievances and claims that individuals or small groups of workers make under the employment legislation listed in Schedule 5 of the Workplace Relations Act
ga: Is í an tSeirbhís Breithniúcháin (Seirbhís an Choimisinéara um Chearta roimhe seo) a fhiosraíonn díospóidí, casaoidí agus éilimh a dhéanann daoine aonair nó grúpaí beaga faoi reachtaíocht na fostaíochta faoi mar a liostaítear i Sceideal 5 den Acht um Chaidreamh Oibreachais

source: Adjudicators are independent in the performance of their duties and have a wide range of functions under this employment legislation
ga: Is neamhspleách iad na bhreithneoirí i gcleachtadh a ndualgas, agus bíonn réimse leathan feidhmeanna acu faoin reachtaíocht fostaíochta seo

source: You can find more information in our document on adjudication of employment rights and disputes
ga: Is féidir leat teacht ar a thuilleadh faisnéise inár gcáipéis faoi bhreithniúchán na gceart agus na ndíospóidí fostaíochta

source: The Inspection Services (formerly operated by NERA) monitor employment conditions to ensure the compliance and enforcement of employment rights legislation
ga: Is í an tSeirbhís Chigireachta (arna hoibriú ag NERA roimhe seo) a dhéanann monatóireacht ar choinníollacha fostaíocht chun comhlíonadh agus forghníomhú na reachtaíochta faoi chearta fostaíochta a chinntiú

source: They also carry out inspections and gather information in relation to other employment laws
ga: Is í an tseirbhís freisin a dhéanann imscrúduithe agus a bhailíonn faisnéis i ndáil le dlíthe fostaíochta eile nach iad

source: For example, employees or interested parties may ask for an inspection in relation to the protection of young people in employment
ga: Cuir i gcás, féadann fostaithe nó páirtithe leasmhara imscrúdú a iarraidh i ndáil le cosaint daoine óga san fhostaíocht

source: You can read more in our document on employment rights legislation inspection and compliance
ga: Is féidir leat a thuilleadh a léamh inár gcáipéis faoi imscrúdú agus comhlíonadh reachtaíocht na gceart fostaíochta

source: Information on rights and entitlements under employment legislation is provided by WRC Information and Customer Service
ga: Soláthraítear faisnéis i leith ceart agus teidlíochtaí faoi reachtaíocht na fostaíochta ag Seirbhís Faisnéise agus Custaiméirí an WRC

source: Employment rights complaints: If you wish to bring an employment rights claim you apply using the online complaint form available on workplacerelations.ie
ga: Gearáin faoi chearta fostaíochta: Más mian leat éileamh faoi chearta fostaíochta a thabhairt is ar líne a dhéanann tú iarratais ag baint leasa as an fhoirm iarratais atá ar fáil ar workplacerelations.ie

source: Mediation: You can apply for mediation using the online mediation referral form available on workplacerelations.ie
ga: An Eadráin: Is féidir leat iarratas a dhéanamh don eadráin trí leas a bhaint as an bhfoirm tarchurtha ar líne atá ar fáil ar workplacerelations.ie

source: Advisory Service: For further information or assistance you can contact the Advisory Service of the Workplace Relations Commission at the address below or by email to advisory@workplacerelations.ie
ga: Seirbhís Chomhairleach: Chun teacht ar a thuilleadh faisnéise nó ar chúnamh is féidir leat teagmháil a dhéanamh leis an tSeirbhís Chomhairleach den Coimisiún um Chaidreamh Oibreachais ag an seoladh thíos nó trí ríomhphost chuig advisory@workplacerelations.ie

source: Conciliation Service: Requests for assistance and enquiries should be sent in writing to the Conciliation Service of the Workplace Relations Commission at the address below or by using the conciliation referral form available on workplacerelations.ie
ga: Seirbhís Idir-Réitigh: Ba cheart na hiarratais ar chúnamh agus fiosruithe a sheoladh i scríbhinn chuig an tSeirbhís Idir-Réitigh de chuid an Choimisiúin um Chaidreamh Oibreachais ag an seoladh thíos nó trí leas a bhaint as an bhfoirm tarchurtha idir-réitigh atá ar fáil ar workplacerelations.ie
